/*
 *
 * 作者：YYC
 * 完成时间：
 * 电子邮箱：395976266@qq.com
 * QQ: 395976266
 * 博客：http://www.cnblogs.com/chaogex/
 *


 版本说明：

 10-21 - 10-27 
    重构代码，面向对象设计(OOD)、面向对象编程(OOP)。

 10-24
    //去掉指南针道具（因为在ie下有问题！而且指南针与炸弹功能差不多。）。

 10-26 
    加入镜子道具，加入Boss类，对游戏逻辑类进行坼分重构。

 */

(function () {








    /*************************************************************** 数据源 ***************************************************/



    /*********************************************************** 数据源结束 ***************************************************/



    /*************************************************************** 数据层 ***************************************************/



    /*************************************************************** 数据层结束 ***************************************************/




    /*************************************************************** 业务逻辑层 *************************************************/


    /***************************************************************** 显示层 **************************************************/


    /*************************************************************** 显示层结束 ************************************************/






    //Boss技能类


   


//    //*操纵代理类

//    //玩家代理类

//    //Boss代理类









////Boss类
//var Boss_Player = MyClass(Parent_Boss_Player, {
//    Public: {
//        //剩余方块数
//        remain_num: 0,
//        //Boss姓名
//        name: "Boss",
//        //Boss经验值
//        experience: 0,
//        //Boss等级
//        level: 0,

//        //参数设置
//        config: {
//            //可以使用的技能
//            ability: [],
//            //Boss消方块速度
//            ai_speed: 1,
//            //玩家计时器速度
//            time_speed: 5,
//            //消去方块时，玩家计时器加的时间
//            addTime: 10
//        },


//        //构造函数
//        Init: function (opt) {
//            if (opt) {
//                this.name = opt.name;
//                this.experience = opt.experience;
//                this.level = opt.level > 5 ? 5 : opt.level;     //等级最大为5级

//                this.config.ability = operate.Clone(opt.config.ability);
//                this.config.ai_speed = opt.config.ai_speed;
//                this.config.time_speed = opt.config.time_speed;
//                this.config.addTime = opt.config.addTime;
//            }
//        },
//        //使用技能
//        Use: function (ability) {
//            //            ability.Do();
//            this.base(ability);
//        },
//        OnStart: function () {
//        },
//        OnEnd: function () {
//        }
//    }
//});





////农民伯伯类

////火枪手类

////......




/*************************************************************** 业务逻辑层结束 ***************************************************/









/*************************************************************** 辅助类 ******************************************************/





/*************************************************************** 辅助类层结束 ************************************************/





////绑定全局入口
//window.MyLianLianGame = App;

} ());




